app/controllers/admins/genres_controller.rb

SELECT "genres".* FROM "genres"
---
	def index
		@genre = Genre.new
		@genres = Genre.all

INSERT INTO "genres" ("name", "is_enabled", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "パンケーキ"], ["is_enabled", 0], ["created_at", "2020-07-19 12:34:15.179824"], ["updated_at", "2020-07-19 12:34:15.179824"]]
---
	def create
		@genre = Genre.new(genre_params)
		if @genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def edit
		@genre = Genre.find(params[:id])

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "genres" SET "is_enabled" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["is_enabled", 0], ["updated_at", "2020-07-19 12:35:02.081612"], ["id", 3]]
---
	def update
		@genre = Genre.find(params[:id])
		if @genre.update(genre_params)