app/controllers/admins/members_controller.rb

SELECT "members".* FROM "members"
---
	def index
	  @members = Member.all

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
	  @member = Member.find(params[:id])

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
	  @member = Member.find(params[:id])

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "members" SET "last_name" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["last_name", "rrrr"], ["updated_at", "2020-07-20 08:10:20.577892"], ["id", 3]]
---
	def update
      @member = Member.find(params[:id])
    if @member.update(member_params)