app/controllers/admins/orders_controller.rb

	def index
		@orders = Order.page(params[:page]).reverse_order
---
SELECT "orders".* FROM "orders"