app/controllers/admins/products_controller.rb

	def create
		@product = Product.new(product_params)
		if @product.save
---
INSERT INTO "products" ("genre_id", "name", "explanatory", "is_capable", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["genre_id", 1], ["name", "aab"], ["explanatory", "ss"], ["is_capable", 0], ["price", 100], ["created_at", "2020-07-19 04:46:55.393813"], ["updated_at", "2020-07-19 04:46:55.393813"]]

	def index
		@products = Product.page(params[:page]).reverse_order
---
SELECT  "products".* FROM "products" LIMIT ?  [["LIMIT", 11]]

	def update
		@product = Product.find(params[:id])
		if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "products" SET "price" = ?, "image_id" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 100], ["image_id", "27721c7901ab6903e4d8f20c7c9fb6294bf30529e68545a21203ef6bb468"], ["updated_at", "2020-07-21 05:57:08.861592"], ["id", 5]]