app/controllers/member/cart_items_controller.rb

INSERT INTO "cart_items" ("created_at", "updated_at", "product_id", "member_id", "number") VALUES (?, ?, ?, ?, ?)  [["created_at", "2020-07-20 11:44:58.026056"], ["updated_at", "2020-07-20 11:44:58.026056"], ["product_id", 9], ["member_id", 1], ["number", 3]]
---
	def create
		@cart_item =  CartItem.new(cart_item_params)
		@cart_item.member_id = current_member.id
		@cart_item.save

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "cart_items" SET "number" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["number", 5], ["updated_at", "2020-07-20 12:07:15.587803"], ["id", 5]]
---
	def update
		@cart_item = CartItem.find(params[:id])
		@cart_item.update(cart_item_params)

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 4]]
---
	def destroy
		@cart_item = CartItem.find(params[:id])
		@cart_item.destroy