app/controllers/member/members_controller.rb

	def show
	   @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? ORDER BY "members"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
	   @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

	def update
      @member = Member.find(params[:id])
    if @member.update(member_params)
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "members" SET "first_name" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["first_name", "　あ"], ["updated_at", "2020-07-20 13:53:25.154338"], ["id", 3]]

    def deactivate
    	@member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]