app/controllers/member/products_controller.rb

	def show
        @genres = Genre.where(is_enabled: true)
		@product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def index
        @genres = Genre.where(is_enabled: true)
    	if params[:genre_id].present?
    	genre = Genre.find(params[:genre_id])
    	@title = genre.name
    	@products = Product.where(genre_id: params[:genre_id], is_capable: true )
    	else
        @products = []
    	@product_statuses = Product.where(is_capable: true)
            @product_statuses.each do |product_status|
---
SELECT "genres".* FROM "genres" WHERE "genres"."is_enabled" = ?  [["is_enabled", 1]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."genre_id" = ?  [["genre_id", 1]]
SELECT "products".* FROM "products" WHERE "products"."is_capable" = ?  [["is_capable", 1]]
SELECT "products".* FROM "products"