app/controllers/member/products_controller.rb

    def index
        @genres = Genre.where(genre_tatus: true)
    	@genres = Genre.all
---
SELECT "genres".* FROM "genres"