app/controllers/member/shippings_controller.rb

	def index
		@shipping = Shipping.new
		@shippings = Shipping.all
---
SELECT "shippings".* FROM "shippings"

	def create
		@shipping = Shipping.new(shipping_params)
		@shipping.member_id = current_member.id
		@shipping.save
---
INSERT INTO "shippings" ("member_id", "name", "postcode", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["member_id", 1], ["name", "ss"], ["postcode", "www"], ["address", "ss"], ["created_at", "2020-07-19 12:02:35.973632"], ["updated_at", "2020-07-19 12:02:35.973632"]]

	def edit
		@shipping = Shipping.find(params[:id])
---
SELECT  "shippings".* FROM "shippings" WHERE "shippings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		@shipping = Shipping.find(params[:id])
		@shipping.update(shipping_params)
---
SELECT  "shippings".* FROM "shippings" WHERE "shippings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "shippings" SET "postcode" = ?, "updated_at" = ? WHERE "shippings"."id" = ?  [["postcode", "555"], ["updated_at", "2020-07-19 12:07:23.348544"], ["id", 1]]