app/controllers/homes_controller.rb

SELECT "genres".* FROM "genres"
---
	def top
		@genres = Genre.all