app/views/admins/products/edit.html.erb

SELECT "genres".* FROM "genres"
---
					<%= f.label :ジャンル,class: "col-xs-3 fix" %>
					<%= f.collection_select :genre_id, Genre.all, :id, :name %>