app/views/admins/products/new.html.erb

					<%= f.label :ジャンル,class: "col-xs-3"  %>
					<%= f.collection_select :genre_id, Genre.all, :id, :name %>
---
SELECT "genres".* FROM "genres"