app/views/admins/orders/index.html.erb

SELECT "orders".* FROM "orders"
---
 			 <td><%= order.member.last_name %></td>
 			 <td><%= order.order_details.sum(:number) %></td>